In [1]:
import pandas as pd
pd.__version__

'1.4.3'

In [38]:
df = pd.read_csv('data/people.csv')
df

   name            clan          email
0   Ali         Sagaras   ali@clan.com
1  Raib           Bulan  raib@clan.com
2  Seli        Matahari  seli@clan.com
3   Ily  Matahari Minor   ily@clan.com

## Adding a column

In [53]:
(df['name'] + '@' + df['clan'] + '.com').str.lower().str.replace(' ', '')

0          ali@sagaras.com
1           raib@bulan.com
2        seli@matahari.com
3    ily@matahariminor.com
dtype: object

In [54]:
new_email = (df['name'] + '@' + df['clan'] + '.com').str.lower().str.replace(' ', '')

In [55]:
df['new_email'] = new_email
df

   name            clan              new_email
0   Ali         Sagaras        ali@sagaras.com
1  Raib           Bulan         raib@bulan.com
2  Seli        Matahari      seli@matahari.com
3   Ily  Matahari Minor  ily@matahariminor.com

## Removing a column

In [44]:
df.drop(columns='email', inplace=True)

In [56]:
df

   name            clan              new_email
0   Ali         Sagaras        ali@sagaras.com
1  Raib           Bulan         raib@bulan.com
2  Seli        Matahari      seli@matahari.com
3   Ily  Matahari Minor  ily@matahariminor.com

## Adding multiple columns

In [60]:
name_clan = df['new_email'].str.replace('.com', '').str.split('@', expand=True)

C:\Users\ASUS VIVOBOOK\AppData\Local\Temp\ipykernel_16556\3582586530.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  name_clan = df['new_email'].str.replace('.com', '').str.split('@', expand=True)

In [63]:
df[['new_name', 'new_clan']] = name_clan
df

   name            clan              new_email new_name       new_clan
0   Ali         Sagaras        ali@sagaras.com      ali        sagaras
1  Raib           Bulan         raib@bulan.com     raib          bulan
2  Seli        Matahari      seli@matahari.com     seli       matahari
3   Ily  Matahari Minor  ily@matahariminor.com      ily  matahariminor

## Removing multiple columns

In [65]:
df.drop(columns=['new_name', 'new_clan'], inplace=True)

In [66]:
df

   name            clan              new_email
0   Ali         Sagaras        ali@sagaras.com
1  Raib           Bulan         raib@bulan.com
2  Seli        Matahari      seli@matahari.com
3   Ily  Matahari Minor  ily@matahariminor.com

In [69]:
df.rename(columns={'new_email':'email'}, inplace=True)
df

   name            clan                  email
0   Ali         Sagaras        ali@sagaras.com
1  Raib           Bulan         raib@bulan.com
2  Seli        Matahari      seli@matahari.com
3   Ily  Matahari Minor  ily@matahariminor.com

## Adding a row

In [74]:
df = df.append({'name': 'Av'}, ignore_index=True)

C:\Users\ASUS VIVOBOOK\AppData\Local\Temp\ipykernel_16556\558389939.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'name': 'Av'}, ignore_index=True)

In [75]:
df

   name            clan                  email
0   Ali         Sagaras        ali@sagaras.com
1  Raib           Bulan         raib@bulan.com
2  Seli        Matahari      seli@matahari.com
3   Ily  Matahari Minor  ily@matahariminor.com
4    Av             NaN                    NaN

## Adding multiple rows

In [77]:
people = {
    'name': ['Lumpu', 'Kosong'],
    'clan': ['Nebula', 'Nebula']
}

df2 = pd.DataFrame(people)

In [78]:
df2

     name    clan
0   Lumpu  Nebula
1  Kosong  Nebula

In [81]:
df2['email'] = (df2['name'] + '@' + df2['clan'] + '.com').str.lower()

In [82]:
df2

     name    clan              email
0   Lumpu  Nebula   lumpu@nebula.com
1  Kosong  Nebula  kosong@nebula.com

In [88]:
df.append(df2, ignore_index=True)

C:\Users\ASUS VIVOBOOK\AppData\Local\Temp\ipykernel_16556\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com
3     Ily  Matahari Minor  ily@matahariminor.com
4      Av             NaN                    NaN
5   Lumpu          Nebula       lumpu@nebula.com
6  Kosong          Nebula      kosong@nebula.com

In [95]:
df3 = pd.concat([df, df2], ignore_index=True)

In [96]:
df3

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com
3     Ily  Matahari Minor  ily@matahariminor.com
4      Av             NaN                    NaN
5   Lumpu          Nebula       lumpu@nebula.com
6  Kosong          Nebula      kosong@nebula.com

## Removing a  row

In [98]:
df3.drop(index=4, inplace=True)

In [99]:
df3

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com
3     Ily  Matahari Minor  ily@matahariminor.com
5   Lumpu          Nebula       lumpu@nebula.com
6  Kosong          Nebula      kosong@nebula.com

In [116]:
filt = (df['clan'] == 'Matahari Minor')

In [117]:
df3.drop(index=df[filt].index)

     name      clan              email
0     Ali   Sagaras    ali@sagaras.com
1    Raib     Bulan     raib@bulan.com
2    Seli  Matahari  seli@matahari.com
5   Lumpu    Nebula   lumpu@nebula.com
6  Kosong    Nebula  kosong@nebula.com

In [118]:
df3.to_csv('people2.csv', index=False)